public class operations {
    public static void Main(String []args){
         byte exByte = 8; // -128 to 128
        short exShort = 16; // -32768 to 32767
        int exInt = 32;     // -2147483648 to 2147483647
        long exLong = 64;  // -9223372036854775808 to 9223372036854775807
        float exFloat = 2.3f;//  1.4e-45f to 3.4e+38f
        double exDouble = 2.3; // 4.9e-324 to 1.7e+308
        boolean exBoolean = false;  // true or false
        char exChar ='a'; // an unsigned integer representing a UTF-16 character (letters and numbers)
        String exString = "Hello"; //

        //Написать код, использующий большинство или все виды операторов, о которых сегодня говорилось.
        int num1 = 1;
        int num2 = 56;
        int num3 = -5;
        // арифметические операторы;
        System.out.println(num1 + num2);


        //операторы сравнения;
        // побитовые операторы;
        // логические операторы;
        // операторы присваивания;
        // прочие операторы.

        //Показать примеры операций над разными типами данных (int + long, например).
        //
        //Добиться переполнения в min и max сторону и посмотреть что произойдет.


    }

}
